from now i will use mysql database table of full jobs data base which i downlaod in dataframe and converted into my mysql data base for ease of use.

In [100]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('mysql+pymysql://root:root@localhost/data_jobs_db')
df = pd.read_sql_table(table_name= 'full_job_table', con=engine, index_col='index')

In [ ]:
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']

index
28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

In [62]:
df_salary_year_avg = df[pd.notna(df['salary_year_avg'])].copy()
def projected_salary(salary):
    return salary*1.03

# df_salary_year_avg['inflated_salary'] = df_salary_year_avg['salary_year_avg'].apply(projected_salary)
df_salary_year_avg['inflated_salary'] = df_salary_year_avg['salary_year_avg'].apply(lambda salary : salary * 1.03)
df_salary_year_avg[['inflated_salary','salary_year_avg']]

        inflated_salary  salary_year_avg
index
28            112785.00         109500.0
77            144200.00         140000.0
92            123600.00         120000.0
100           235068.66         228222.0
109            91670.00          89000.0
...                 ...              ...
785624        143392.48         139216.0
785641        154500.00         150000.0
785648        228531.25         221875.0
785682        162225.00         157500.0
785692        162225.00         157500.0

[22003 rows x 2 columns]

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  int64
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  int64
 9   job_health_insurance   785741 non-null  int64
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(3), object(11)
memory usage: 107.9+ MB

In [101]:
import ast 
# ast.literal_eval(df['job_skills'][1])
# print(pd.isna(df['job_skills']))

def convert_list(skills):
    if pd.notna(skills):
        return ast.literal_eval(skills)

df['job_skills'] = df['job_skills'].apply(lambda skills : ast.literal_eval(skills) if pd.notna(skills) else skills)

In [102]:
type(df['job_skills'][1])

list

In [114]:
df_salary_year_avg[['salary_year_avg','inflated_salary']]

def customized_inflation(row):
    if "Senior" in row['job_title_short']:
        return 1.05 * row['salary_year_avg']
    else :
        return  1.03 * row['salary_year_avg']
    
df_salary_year_avg['customized_inflation'] = df_salary_year_avg.apply(customized_inflation,axis=1)
df_salary_year_avg[['job_title_short','salary_year_avg','inflated_salary','customized_inflation']]

       job_title_short  salary_year_avg  inflated_salary  customized_inflation
index
28      Data Scientist         109500.0        112785.00             112785.00
77       Data Engineer         140000.0        144200.00             144200.00
92       Data Engineer         120000.0        123600.00             123600.00
100     Data Scientist         228222.0        235068.66             235068.66
109       Data Analyst          89000.0         91670.00              91670.00
...                ...              ...              ...                   ...
785624   Data Engineer         139216.0        143392.48             143392.48
785641   Data Engineer         150000.0        154500.00             154500.00
785648  Data Scientist         221875.0        228531.25             228531.25
785682  Data Scientist         157500.0        162225.00             162225.00
785692  Data Scientist         157500.0        162225.00             162225.00

[22003 rows x 4 columns]